# Описание решения задачи

## Задача
Написать программу на языке C#, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше либо равна 3 символам. Исходный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


## Описание решения
1. **Проверка, задан ли массив вручную**: Если исходный массив не задан в коде, программа предложит пользователю ввести массив строк с клавиатуры.
2. **Ввод массива строк с клавиатуры**: Если массив не задан вручную, пользователь вводит строки через пробел, и они преобразуются в массив строк.
3. **Подсчет количества строк, удовлетворяющих условию**: Проходим по исходному массиву и подсчитываем количество строк, длина которых меньше или равна 3 символам.
4. **Создание нового массива**: Создаем новый массив строк нужного размера и заполняем его строками из исходного массива, удовлетворяющими условию.
5. **Вывод результатов**: Выводим результат в консоль в формате: [исходный массив] -> [новый массив]


## Код программы c комментариями
using System;

class Program
{
    static void Main()
    {
        // Исходный массив строк:
        // указать null для последующего ввода с клавиатуры
        // задать массив в коде изначально, например string[] sourceArray = { "Hello", "2", "world", ":-)" }; 
        string[] sourceArray = { "Hello", "2", "world", ":-)" }; // Задайте массив здесь

        // Проверка, задан ли массив вручную
        if (sourceArray == null || sourceArray.Length == 0)
        {
            // Ввод массива строк с клавиатуры
            Console.WriteLine("Введите строки через пробел:");
            string input = Console.ReadLine();
            sourceArray = input.Split(' ');
        }

        // Подсчет количества строк, длина которых меньше или равна 3 символам
        int count = 0;
        foreach (string str in sourceArray)
        {
            if (str.Length <= 3)
            {
                count++;
            }
        }

        // Создание нового массива для хранения строк, длина которых <= 3 символам
        string[] resultArray = new string[count];
        int index = 0;
        foreach (string str in sourceArray)
        {
            if (str.Length <= 3)
            {
                resultArray[index] = str;
                index++;
            }
        }

        // Вывод результата в консоль
        Console.WriteLine("[" + string.Join(", ", sourceArray) + "] -> [" + string.Join(", ", resultArray) + "]");
    }
}

## Заключение
Программа сначала проверяет, задан ли исходный массив вручную. Если массив не задан, пользователю будет предложено ввести массив строк с клавиатуры.